[NoCoverage] ArrowFunction
src/main.ts:6:10
 import { AppComponent } from './app/app.component';
 
 bootstrapApplication(AppComponent, appConfig)
-  .catch((err) => console.error(err));
+  .catch(() => undefined);
 
