[Killed] BlockStatement
app/components/media-grid/media-grid.component.ts:17:14
 
   public media: MediaFolder[] = [];
 
-  ngOnInit() {
-    this.mediaService.getMediaFolders().subscribe(folders => this.media = folders);
-  }
+  ngOnInit() {}
 }
 
killedBy: MediaGridComponent should populate media on init when media folders are returned
statusReason: Expected $.length = 0 to equal 1.
Expected $[0] = undefined to equal Object({ name: 'Folder 1', path: '/folder1', children: [  ] }).

[Killed] ArrowFunction
app/components/media-grid/media-grid.component.ts:18:51
   public media: MediaFolder[] = [];
 
   ngOnInit() {
-    this.mediaService.getMediaFolders().subscribe(folders => this.media = folders);
+    this.mediaService.getMediaFolders().subscribe(() => undefined);
   }
 }
killedBy: MediaGridComponent should populate media on init when media folders are returned
statusReason: Expected $.length = 0 to equal 1.
Expected $[0] = undefined to equal Object({ name: 'Folder 1', path: '/folder1', children: [  ] }).
