[Killed] BlockStatement
app/services/media/media.service.ts:17:55
 
   private endpoint = environment.BACKEND_URL;
 
-  public getMediaFolders(): Observable<MediaFolder[]> {
-    return this.httpClient.get<MediaFolder[]>(this.endpoint + "/media");
-  }
+  public getMediaFolders(): Observable<MediaFolder[]> {}
 }
 
killedBy: MediaService should retrieve media folders successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
